{"seen_titles": ["Bitcoin Rebounds Above $88K—Will It Last?", "Japan’s FSA to Mandate Liability Reserves for Crypto Exchanges to Enhance Security: Report", "Custodia renews bid for Fed master account in rehearing push at Tenth Circuit", "8% of Bitcoin changed hands in a week as markets on ‘knife’s edge’: Analysts", "What Is a Layer-1 Blockchain? The Base Layer Powering Bitcoin and Crypto", "Bitcoin long-term holder supply hits 8-month lows: Bullish or bearish?", "Cameo Wins Temporary Restraining Order Against OpenAI", "XRP Surges 7% in Strongest Breakout in Weeks as Ripple Linked ETFs Go Live", "Stablecoin giant Tether makes $1B bid to buy Juventus FC", "JPMorgan Chase Ends Banking Ties With Strike CEO, Rekindling Crypto Debanking Concerns", "MoonPay secures New York trust charter, expands regulated services", "Why the SEC’s new guidelines could speed up the approval process for new crypto ETFs", "Could Stablecoins Spark a New Contagion? BIS Warns, Coinbase Pushes Back", "South Africa’s central bank flags crypto, stablecoins as financial risk", "UAE’s new financial law pulls DeFi and Web3 into regulatory scope", "'Privacy Is Hygiene,’ Says Ethereum Creator Vitalik Buterin After Bank Data Leak", "XRP, SUI Lead Crypto Rebound as Bitcoin Tops $89K; Relief Rally Faces $100K Wall, Trader Says", "Winklevoss-led Gemini rolls out prediction markets in 50 US states", "Stellar price forecast: XLM could rally higher as TVL hits new ATH", "Republicans urge action on market structure bill over debanking claims", "How Zcash went from low-profile token to the most-searched asset in November 2025", "Solana Holders Under Pressure as Sell-Off Deepens", "ECB Warns Stablecoins’ Growth Spurs Potential Spillover Risks in Euro Area", "Celestia’s TIA Token Rises as ‘Matcha’ Upgrade Preps Network for Cross-Chain Future", "The $1.7B Bitcoin Bet on Rally Above $100K, But Not Reaching New Record Highs", "Japan’s FSA to Mandate Liability Reserves for Crypto Exchanges to Enhance Security", "Asia Morning Briefing: BTC Steadies as Polymarket Traders Lean Toward December Rate Cut", "Monad airdrop farmer spends full $112K MON rewards on gas for failed trades", "Price predictions 12/1: SPX, DXY, BTC, ETH, XRP, BNB, SOL, DOGE, ADA, BCH", "Bitcoin sharks stack at the fastest pace in 13 years, with BTC down 30%", "Over 1 in 20 emails are malicious, warns internet giant Cloudflare", "Over 8% of Bitcoin changed hands in week, markets on ‘knife’s edge,’ Analysts say", "Satoshi Nakamoto's Bitcoin Wealth Falls By $41 Billion, Now Poorer Than Bill Gates", "Bitcoin falls to $84K: Is Japan’s bond market the culprit, or is more at play?", "Forward Industries hires former ParaFi executive to lead Solana treasury strategy", "Spain’s regulator sets out MiCA transition rules for crypto platforms", "ECB Doubles Down on Warning That Stablecoins Could Pose Global Financial Risks", "Department of Government Efficiency Winds Down Despite Months Left To Run: Report", "Most crypto sectors lagged Bitcoin over past 3 months: Glassnode", "Monad airdrop farmer spends full $112K MON reward on gas for failed trades", "Berachain disputes ‘framing’ of a $25M refund deal to Brevan Howard", "Crypto groups slam Citadel for urging tighter DeFi tokenization rules", "Brazil’s largest private bank advises investors to allocate 3% to Bitcoin in 2026", "Bitcoin’s lack of price strength due to sheepish spot buyers: What happens next?", "Bitcoin sharks stack at fastest pace in 13 years, with BTC down 30%", "HBAR Gains 2.4% From Major Support as Axelar Integration Drives DeFi Activity", "Japan's FSA to Require Crypto Exchanges Hold Liability Reserves for Losses Relating to Hacks", "VanEck quietly backpedals on BNB ETF staking in latest SEC filing", "Buterin says X’s new location feature ‘risky’ as crypto users flag privacy concerns", "XRP price ‘looking very bullish’ after 25% weekly gain: How high can it go?", "Crypto ETF flows: BTC sees $151M outflows as ETH and SOL funds thrive"]}